ruturajbendkhale/STM32H756ZG_Nucleo_sandbox_FCDEV/Core/Inc/lsm6dso_reg.h
int32_t lsm6dso_fifo_data_level_get(stmdev_ctx_t *ctx, uint16_t *val);

int32_t lsm6dso_fifo_status_get(stmdev_ctx_t *ctx,
                                lsm6dso_fifo_status2_t *val);

int32_t lsm6dso_fifo_full_flag_get(stmdev_ctx_t *ctx, uint8_t *val);

int32_t lsm6dso_fifo_ovr_flag_get(stmdev_ctx_t *ctx, uint8_t *val);

int32_t lsm6dso_fifo_wtm_flag_get(stmdev_ctx_t *ctx, uint8_t *val);

int32_t lsm6dso_fifo_sensor_tag_get(stmdev_ctx_t *ctx,
                                    lsm6dso_fifo_tag_t *val);

int32_t lsm6dso_fifo_pedo_batch_set(stmdev_ctx_t *ctx, uint8_t val);
int32_t lsm6dso_fifo_pedo_batch_get(stmdev_ctx_t *ctx, uint8_t *val);

int32_t lsm6dso_sh_batch_slave_0_set(stmdev_ctx_t *ctx, uint8_t val);
int32_t lsm6dso_sh_batch_slave_0_get(stmdev_ctx_t *ctx, uint8_t *val);

int32_t lsm6dso_sh_batch_slave_1_set(stmdev_ctx_t *ctx, uint8_t val);
int32_t lsm6dso_sh_batch_slave_1_get(stmdev_ctx_t *ctx, uint8_t *val);

int32_t lsm6dso_sh_batch_slave_2_set(stmdev_ctx_t *ctx, uint8_t val);
int32_t lsm6dso_sh_batch_slave_2_get(stmdev_ctx_t *ctx, uint8_t *val);

int32_t lsm6dso_sh_batch_slave_3_set(stmdev_ctx_t *ctx, uint8_t val);
int32_t lsm6dso_sh_batch_slave_3_get(stmdev_ctx_t *ctx, uint8_t *val);

typedef enum
{
  LSM6DSO_DEN_DISABLE    = 0,
  LSM6DSO_LEVEL_FIFO     = 6,
  LSM6DSO_LEVEL_LETCHED  = 3,
  LSM6DSO_LEVEL_TRIGGER  = 2,
  LSM6DSO_EDGE_TRIGGER   = 4,
} lsm6dso_den_mode_t;
int32_t lsm6dso_den_mode_set(stmdev_ctx_t *ctx,
                             lsm6dso_den_mode_t val);
int32_t lsm6dso_den_mode_get(stmdev_ctx_t *ctx,
                             lsm6dso_den_mode_t *val);

typedef enum
{
  LSM6DSO_DEN_ACT_LOW  = 0,
  LSM6DSO_DEN_ACT_HIGH = 1,
} lsm6dso_den_lh_t;
int32_t lsm6dso_den_polarity_set(stmdev_ctx_t *ctx,
                                 lsm6dso_den_lh_t val);
int32_t lsm6dso_den_polarity_get(stmdev_ctx_t *ctx,
                                 lsm6dso_den_lh_t *val);

typedef enum
{
  LSM6DSO_STAMP_IN_GY_DATA     = 0,
  LSM6DSO_STAMP_IN_XL_DATA     = 1,
  LSM6DSO_STAMP_IN_GY_XL_DATA  = 2,
} lsm6dso_den_xl_g_t;
int32_t lsm6dso_den_enable_set(stmdev_ctx_t *ctx,
                               lsm6dso_den_xl_g_t val);
int32_t lsm6dso_den_enable_get(stmdev_ctx_t *ctx,
                               lsm6dso_den_xl_g_t *val);

int32_t lsm6dso_den_mark_axis_x_set(stmdev_ctx_t *ctx, uint8_t val);
int32_t lsm6dso_den_mark_axis_x_get(stmdev_ctx_t *ctx, uint8_t *val);

int32_t lsm6dso_den_mark_axis_y_set(stmdev_ctx_t *ctx, uint8_t val);
int32_t lsm6dso_den_mark_axis_y_get(stmdev_ctx_t *ctx, uint8_t *val);

int32_t lsm6dso_den_mark_axis_z_set(stmdev_ctx_t *ctx, uint8_t val);
int32_t lsm6dso_den_mark_axis_z_get(stmdev_ctx_t *ctx, uint8_t *val);

typedef enum
{
  LSM6DSO_PEDO_BASE_MODE            = 0x00,
  LSM6DSO_FALSE_STEP_REJ            = 0x10,
  LSM6DSO_FALSE_STEP_REJ_ADV_MODE   = 0x30,
} lsm6dso_pedo_md_t;
int32_t lsm6dso_pedo_sens_set(stmdev_ctx_t *ctx,
                              lsm6dso_pedo_md_t val);
int32_t lsm6dso_pedo_sens_get(stmdev_ctx_t *ctx,
                              lsm6dso_pedo_md_t *val);

int32_t lsm6dso_pedo_step_detect_get(stmdev_ctx_t *ctx, uint8_t *val);

int32_t lsm6dso_pedo_debounce_steps_set(stmdev_ctx_t *ctx,
                                        uint8_t *buff);
int32_t lsm6dso_pedo_debounce_steps_get(stmdev_ctx_t *ctx,
                                        uint8_t *buff);

int32_t lsm6dso_pedo_steps_period_set(stmdev_ctx_t *ctx,
                                      uint16_t val);
int32_t lsm6dso_pedo_steps_period_get(stmdev_ctx_t *ctx,
                                      uint16_t *val);

typedef enum
{
  LSM6DSO_EVERY_STEP     = 0,
  LSM6DSO_COUNT_OVERFLOW = 1,
} lsm6dso_carry_count_en_t;
int32_t lsm6dso_pedo_int_mode_set(stmdev_ctx_t *ctx,
                                  lsm6dso_carry_count_en_t val);
int32_t lsm6dso_pedo_int_mode_get(stmdev_ctx_t *ctx,
                                  lsm6dso_carry_count_en_t *val);

int32_t lsm6dso_motion_flag_data_ready_get(stmdev_ctx_t *ctx,
                                           uint8_t *val);

int32_t lsm6dso_tilt_flag_data_ready_get(stmdev_ctx_t *ctx,
                                         uint8_t *val);

int32_t lsm6dso_mag_sensitivity_set(stmdev_ctx_t *ctx, uint16_t val);
int32_t lsm6dso_mag_sensitivity_get(stmdev_ctx_t *ctx, uint16_t *val);

int32_t lsm6dso_mag_offset_set(stmdev_ctx_t *ctx, int16_t *val);
int32_t lsm6dso_mag_offset_get(stmdev_ctx_t *ctx, int16_t *val);

int32_t lsm6dso_mag_soft_iron_set(stmdev_ctx_t *ctx, int16_t *val);
int32_t lsm6dso_mag_soft_iron_get(stmdev_ctx_t *ctx, int16_t *val);

typedef enum
{
  LSM6DSO_Z_EQ_Y     = 0,
  LSM6DSO_Z_EQ_MIN_Y = 1,
  LSM6DSO_Z_EQ_X     = 2,
  LSM6DSO_Z_EQ_MIN_X = 3,
  LSM6DSO_Z_EQ_MIN_Z = 4,
  LSM6DSO_Z_EQ_Z     = 5,
} lsm6dso_mag_z_axis_t;
int32_t lsm6dso_mag_z_orient_set(stmdev_ctx_t *ctx,
                                 lsm6dso_mag_z_axis_t val);
int32_t lsm6dso_mag_z_orient_get(stmdev_ctx_t *ctx,
                                 lsm6dso_mag_z_axis_t *val);

typedef enum
{
  LSM6DSO_Y_EQ_Y     = 0,
  LSM6DSO_Y_EQ_MIN_Y = 1,
  LSM6DSO_Y_EQ_X     = 2,
  LSM6DSO_Y_EQ_MIN_X = 3,
  LSM6DSO_Y_EQ_MIN_Z = 4,
  LSM6DSO_Y_EQ_Z     = 5,
} lsm6dso_mag_y_axis_t;
int32_t lsm6dso_mag_y_orient_set(stmdev_ctx_t *ctx,
                                 lsm6dso_mag_y_axis_t val);
int32_t lsm6dso_mag_y_orient_get(stmdev_ctx_t *ctx,
                                 lsm6dso_mag_y_axis_t *val);

typedef enum
{
  LSM6DSO_X_EQ_Y     = 0,
  LSM6DSO_X_EQ_MIN_Y = 1,
  LSM6DSO_X_EQ_X     = 2,
  LSM6DSO_X_EQ_MIN_X = 3,
  LSM6DSO_X_EQ_MIN_Z = 4,
  LSM6DSO_X_EQ_Z     = 5,
} lsm6dso_mag_x_axis_t;
int32_t lsm6dso_mag_x_orient_set(stmdev_ctx_t *ctx,
                                 lsm6dso_mag_x_axis_t val);
int32_t lsm6dso_mag_x_orient_get(stmdev_ctx_t *ctx,
                                 lsm6dso_mag_x_axis_t *val);

int32_t lsm6dso_long_cnt_flag_data_ready_get(stmdev_ctx_t *ctx,
                                             uint8_t *val);

typedef struct
{
  lsm6dso_fsm_enable_a_t          fsm_enable_a;
  lsm6dso_fsm_enable_b_t          fsm_enable_b;
} lsm6dso_emb_fsm_enable_t;
int32_t lsm6dso_fsm_enable_set(stmdev_ctx_t *ctx,
                               lsm6dso_emb_fsm_enable_t *val);
int32_t lsm6dso_fsm_enable_get(stmdev_ctx_t *ctx,
                               lsm6dso_emb_fsm_enable_t *val);

int32_t lsm6dso_long_cnt_set(stmdev_ctx_t *ctx, uint16_t val);
int32_t lsm6dso_long_cnt_get(stmdev_ctx_t *ctx, uint16_t *val);

